<a href="https://colab.research.google.com/github/Ville0/Data-Science/blob/main/Data%20Science.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [27]:
import pandas as pd
import numpy as np

import numpy as np
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')


3 * 4

3 ** 4

2 + 3
2 - 3
2 * 3
7 / 3
7 % 3
2 ** 0.5

1 + 2 * 3 * 4 * 5 / 6 ** 3 + 7 + 8 - 9 + 10

1 + 2 * (3 * 4 * 5 / 6) ** 3 + 7 + 8 - 9 + 10

a = 10
b = 20
a + b

quarter = 1/4
half = 2 * quarter
half

quarter = 4
half

purchase_price = 5
state_tax_rate = 0.075
county_tax_rate = 0.02
city_tax_rate = 0
sales_tax_rate = state_tax_rate + county_tax_rate + city_tax_rate
sales_tax = purchase_price * sales_tax_rate
sales_tax

initial = 2766000
changed = 2814000
(changed - initial) / initial

(changed/initial) - 1

initial = 2766
changed = 2814
(changed/initial) - 1

initial = 2.37
changed = 3.38
(changed/initial) - 1

initial = 287.6
changed = 314.1
(changed/initial) - 1

initial = 15.3
changed = 11.9
(changed/initial) - 1

1.035 * 1.035 * 1.035 * 1.035 * 1.035 * 1.035 * 1.035 * 1.035 * 1.035 * 1.035 - 1

annual_growth_rate = 0.035
ten_year_growth_rate = (1 + annual_growth_rate) ** 10 - 1
ten_year_growth_rate

initial = 2.37
changed = 3.38
t = 10
(changed/initial) ** (1/t) - 1

abs(-12)

round(5 - 1.3)

max(2, 2 + 3, 4)

import math
import operator
math.sqrt(operator.add(4, 5))

(4 + 5) ** 0.5

florida = 2.72
iowa = 16.25
100*abs(florida-iowa)/((florida+iowa)/2)

math.log(16, 2)

math.log(16)/math.log(2)

4.0

In [35]:
from google.colab import files 
  
  
uploaded = files.upload()

import io 
  
data = pd.read_csv(io.BytesIO(uploaded['test.csv'])) 
print(data)

Saving test.csv to test (9).csv
     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [30]:
data

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [40]:
data.head(2)

   PassengerId  Pclass                              Name  ...    Fare  Cabin  Embarked
0          892       3                  Kelly, Mr. James  ...  7.8292    NaN         Q
1          893       3  Wilkes, Mrs. James (Ellen Needs)  ...  7.0000    NaN         S

[2 rows x 11 columns]

In [49]:
data.loc[0:6,['Name','Age']]

                                           Name   Age
0                              Kelly, Mr. James  34.5
1              Wilkes, Mrs. James (Ellen Needs)  47.0
2                     Myles, Mr. Thomas Francis  62.0
3                              Wirz, Mr. Albert  27.0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0
5                    Svensson, Mr. Johan Cervin  14.0
6                          Connolly, Miss. Kate  30.0